#+TITLE: The Dotrice (VTS — [[https://www.atomicl.net][www.atomicl.net]]'s dotfiles)
#+DESCRIPTION: The Dotrice repo contains configuration files for various programs
#+AUTHOR: VTS

*** Set Default applications
Programs implement default application associations in different ways. While command-line programs traditionally use environment variables, graphical applications tend to use XDG MIME Applications through either the GIO API, the Qt API, or by executing ~/usr/bin/xdg-open~, which is part of =xdg-utils=. 

Source: https://wiki.archlinux.org/title/default_applications

Identifying the MIME type for the given file extension:
#+begin_src shell
  xdg-mime query filetype Documents/test.pdf
#+end_src

#+RESULTS:
:RESULTS:
application/pdf
:END:

Discovering the default application for a specific file type:
#+begin_src shell
  xdg-mime query default application/pdf
#+end_src

#+RESULTS:
:RESULTS:
okularApplication_pdf.desktop
:END:

Setting the default application for a MIME type:
#+begin_src shell
  xdg-mime default zathura.desktop application/pdf
#+end_src

Checking if the changes were successfully applied:
#+begin_src shell
  xdg-open test.pdf
#+end_src

